In [1]:
import pandas as pd

In [2]:
person1 = pd.Series({'Name':'Bob', 'Lastname':'Smith', 'Age':'25'})
person2 = pd.Series({'Name':'Helen', 'Lastname':'Carrey', 'Age':'32'})
person3 = pd.Series({'Name':'Ray', 'Lastname':'Brown', 'Age':'22'})

In [3]:
df = pd.DataFrame([person1, person2, person3])
df.head()

    Name Lastname Age
0    Bob    Smith  25
1  Helen   Carrey  32
2    Ray    Brown  22

In [5]:
people = [{'Name':'Bob', 'Lastname':'Smith', 'Age':'25'},
         {'Name':'Helen', 'Lastname':'Carrey', 'Age':'32'},
         {'Name':'Ray', 'Lastname':'Brown', 'Age':'22'}]

df = pd.DataFrame(people, index=range(1, len(people) + 1))

df.head()

    Name Lastname Age
1    Bob    Smith  25
2  Helen   Carrey  32
3    Ray    Brown  22

In [8]:
df.loc[2]

Name         Helen
Lastname    Carrey
Age             32
Name: 2, dtype: object

In [9]:
df.loc[2, 'Age']

'32'

In [15]:
df.loc[2]['Age']

'32'

In [16]:
df.T

              1       2      3
Name        Bob   Helen    Ray
Lastname  Smith  Carrey  Brown
Age          25      32     22

In [17]:
df.T.loc['Lastname']

1     Smith
2    Carrey
3     Brown
Name: Lastname, dtype: object

In [18]:
df['Name']

1      Bob
2    Helen
3      Ray
Name: Name, dtype: object

In [20]:
print(type(df.loc[2]))
print(type(df.loc[2]['Name']))

<class 'pandas.core.series.Series'>
<class 'str'>

In [21]:
df.loc[:,['Name', 'Age']]

    Name Age
1    Bob  25
2  Helen  32
3    Ray  22

In [22]:
df.drop(2)

  Name Lastname Age
1  Bob    Smith  25
3  Ray    Brown  22

In [23]:
copy_df = df.copy()
copy_df.drop('Name', inplace=True, axis=1)
copy_df

  Lastname Age
1    Smith  25
2   Carrey  32
3    Brown  22

In [24]:
del copy_df['Age']
copy_df

  Lastname
1    Smith
2   Carrey
3    Brown

In [25]:
df['Car'] = None
df

    Name Lastname Age   Car
1    Bob    Smith  25  None
2  Helen   Carrey  32  None
3    Ray    Brown  22  None